Revit 2024 API
ViewSchedule.RowHeight Property
 Defines the schedule body rows height.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public double RowHeight { get; set; }
Visual Basic
Public Property RowHeight As Double
	Get
	Set
Visual C++
public:
property double RowHeight {
	double get ();
	void set (double value);
}
Field Value
 The row height for any body rows in the schedule.
Remarks
Setting this property will force all or image only (depending on how RowHeightOverride is defined) schedule body rows to be resized to the indicated height value (when viewed as a ScheduleSheetInstance on a ViewSheet). If the value that is set is smaller than the height of the text (single or multi line), then that value is not taken into account. To access or set this property the RowHeightOverride property should not be None
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for rowHeight must be between 0 and 30000 feet.
Autodesk.Revit.Exceptions.InvalidOperationException |  The RowHeightOverride property is set to RowHeightOverrideOptions.None.
See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace